===================
import statement
===================

import somePackage;

---

(module (import_statement (keyword) (identifier)))

===================
import statement with path
===================

import my.other.package;

---

(module 
  (import_statement 
    (keyword) 
    (member_expression 
      (identifier)
      (member_expression 
        (identifier)
        (identifier)
      )
    )
  )
)

===================
multiple import statements
===================

import my.other.package;
import banana;
import test.other.SomeClass;

---

(module 
  (import_statement 
    (keyword)
    (member_expression 
      (identifier)
      (member_expression 
        (identifier)
        (identifier)
      )
    )
  )
  (import_statement 
    (keyword) 
    (identifier)
  )
  (import_statement 
    (keyword)
    (member_expression 
      (identifier)
      (member_expression 
        (identifier)
        (identifier)
      )
    )
  )
)

===================
using statement
===================

using somePackage;

---

(module (using_statement (keyword) (identifier)))


