===================
Empty Package Name
===================

package;

---

(module (package_statement (keyword)))

===================
Package Name
===================

package my;

---

(module (package_statement (keyword) (identifier)))

===================
Package Name with single path
===================

package my.other;

---

(module 
  (package_statement 
    (keyword) 
    (member_expression
      (identifier)
      (identifier)
    )
  )
)

===================
Package Name with path
===================

package my.other.package;

---

(module 
  (package_statement 
    (keyword) 
    (member_expression
      (identifier)
      (member_expression
        (identifier)
        (identifier)
      )
    )
  )
)
