===================
Empty Package Name
===================

package;

---

(module (package_statement))

===================
Package Name
===================

package my;

---

(module (package_statement (identifier)))

===================
Package Name with single path
===================

package my.other;

---

(module
  (package_statement
    (member_expression
      (identifier)
      (identifier)
    )
  )
)

===================
Package Name with path
===================

package my.other.package;

---

(module
  (package_statement
    (member_expression
      (identifier)
      (member_expression
        (identifier)
        (identifier)
      )
    )
  )
)
